

##########################################################################
# IN1
import this

##########################################################################
# IN2
'''
문제 : 숫자 2개 입력 -> 제곱해서 더하기'''
a,b=map(int,input().split())
print(a**2 + b**2)

##########################################################################
# IN3
'''
문제 : 문자열 입력, 구간 입력 -> 해당 구간의 문자열 출력'''
st = input()
a,b,c,d = map(int,input().split())
print(st[a:b+1],st[c:d+1])

##########################################################################
# IN4
'''
문제 : 두 양수 주어지고, 양수사이의 모든 홀수의 합 구하기
알고리즘1 : for문 이용하여 두 양수사이의 2로 나누어서 0 안되는 수의 합
알고리즘2 : 리스트컴프리핸션 이용 마찬가지
'''
start,end = map(int,input().split())
total=0
for i in range(start,end+1):
    if i%2 != 0:
        total+=i
print(total)

##########################################################################
# IN4 간단한 풀이
start,end = map(int,input().split())
print(sum([i for i in range(start,end+1) if i % 2 != 0]))

##########################################################################
# IN5
'''
문제 : 주어진 텍스트에서 짝수줄에 있는 문자열만 출력
알고리즘 : range에서 2씩 건너뛰어 출력
'''
f = open('rosalind_ini5.txt','r')
fl = f.readlines()
for i in range(1,len(fl),2):
    print(fl[i].rstrip())

    
##########################################################################
# IN6
'''
문제 : 주어진 한 문장에대해 공백을 구분자로하여 단어의 중복된 개수 출력하기
알고리즘 : 딕셔너리 이용 단어를 순차적으로 탐색하여 딕셔너리에 없으면 추가, 있으면 1더하기'''
st = input().split()

di = dict()
for i in st:
    if i not in di:
        di[i]=1
    else:
        di[i]+=1

for k,v in di.items():
    print(k,v)

